import React from "react";

export default function DeliveryPage() {
  return (
    <div className="max-w-4xl mx-auto p-6 bg-[#f5f5dc] shadow rounded text-black leading-relaxed">
      <h1 className="text-2xl font-bold mb-4 text-black">
        Умови оплати та доставки
      </h1>

      <p className="mb-4">
        Під час покупки Ви можете вибрати наступні способи оплати товару:
      </p>

      <ul className="list-disc list-inside mb-4">
        <li>Онлайн-оплата банківською картою LiqPay.</li>
        <li>
          Післяплата: ви можете оплатити замовлення при отриманні товару. Такий
          спосіб ідеально підходить, якщо ви бажаєте перевірити посилку перед
          оплатою.
        </li>
        <li>Оплата на розрахунковий рахунок.</li>
      </ul>

      <p className="mb-4 text-red-600 font-semibold">
        УВАГА! Шановні покупці, перед тим як оплачувати замовлення обов'язково
        уточнюйте його наявність у менеджера.
      </p>

      <h2 className="text-xl font-semibold mt-6 mb-2 text-black">
        Доставка товарів
      </h2>
      <p className="mb-4">
        Ми здійснюємо доставку по всій Україні за допомогою надійних логістичних
        партнерів. Стандартний термін доставки — 1-3 робочі дні, залежно від
        вашого місцезнаходження.
      </p>

      <p className="mb-4">
        Під час покупки Ви можете вибрати наступні способи доставки товару:
      </p>

      <ul className="list-disc list-inside mb-4">
        <li>
          До відділення Нової Пошти (мала до 2 кг — 80 грн.; середня до 10 кг —
          110 грн.)
        </li>
        <li>
          Поштомат Нової Пошти (мала до 2 кг — 80 грн.; середня до 10 кг — 110
          грн.)
        </li>
        <li>
          Кур'єром Нової Пошти (додатково +35 грн для відправлень до 30 кг)
        </li>
      </ul>
    </div>
  );
}
